<a href="https://colab.research.google.com/github/mkjubran/IntroToPython-NonIT/blob/main/PandasBasics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Basics
By the end of this tutorial, you will be able to:

-       Read and store data using Pandas

-       Manipulate data using Pandas

# Pandas DataFrames

Pandas is a high-level data manipulation tool. Its key data structure is called the DataFrame. DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables.

There are several ways to create a DataFrame. One way way is to use a dictionary.

In [88]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

print('This is the dictionary data')
print(dict)


import pandas as pd  ## importing the pandas library


brics = pd.DataFrame(dict) ## converting the dictionary data into pandas dataframe


print('\n\nThis is the Pandas DataFrame')
brics

This is the dictionary data
{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'], 'capital': ['Brasilia', 'Moscow', 'New Dehli', 'Beijing', 'Pretoria'], 'area': [8.516, 17.1, 3.286, 9.597, 1.221], 'population': [200.4, 143.5, 1252, 1357, 52.98]}


This is the Pandas DataFrame

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**Exercise 1.1:** C??????

In [ ]:
## Write your code here

Another way is by creating Dataframe from Series.

Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet. Labels need not be unique but must be a hashable type. The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index. [2]

In [89]:
import pandas as pd 

## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
capital = ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.597, 1.221]
population = [200.4, 143.5, 1252, 1357, 52.98]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series, 'population': population_series} 
  
brics = pd.DataFrame(brics_dict) 
  
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In another way, a DataFrame can be created by importing a csv file using Pandas.

First we need to upload/clone the carsprices.csv file.

In [25]:
!rm -rf ./MachineLearning
!git clone https://github.com/mkjubran/MachineLearning.git

Cloning into 'MachineLearning'...
remote: Enumerating objects: 7, done.
remote: Counting objects: 100% (7/7), done.
remote: Compressing objects: 100% (6/6), done.
remote: Total 257 (delta 1), reused 6 (delta 1), pack-reused 250
Receiving objects: 100% (257/257), 72.83 MiB | 20.06 MiB/s, done.
Resolving deltas: 100% (116/116), done.

Now, the csv cars.csv is stored and can be imported using pd.read_csv.

In [90]:
# Import pandas as pd
import pandas as pd

# Import the cars.csv data: cars
cars = pd.read_csv("./MachineLearning/1_Regression/carprices.csv")

# Print out cars
cars

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

# Indexing DataFrames
There are several ways to index a Pandas DataFrame. One of the easiest ways to do this is by using square bracket notation.

In the example below, you can use square brackets to select one column of the cars DataFrame. You can either use a single bracket or a double bracket. The single bracket with output a Pandas Series, while a double bracket will output a Pandas DataFrame.

Print out Mileage column as Pandas Series

In [91]:
# Import pandas and cars.csv
import pandas as pd
cars = pd.read_csv("./MachineLearning/1_Regression/carprices.csv", index_col = 0)

# Print out Mileage column as Pandas Series
x=cars['Mileage']
print(type(x))
cars['Mileage']

<class 'pandas.core.series.Series'>

Car Model
BMW X5                   69000
BMW X5                   35000
BMW X5                   57000
BMW X5                   22500
BMW X5                   46000
Audi A5                  59000
Audi A5                  52000
Audi A5                  72000
Audi A5                  91000
Mercedez Benz C class    67000
Mercedez Benz C class    83000
Mercedez Benz C class    79000
Mercedez Benz C class    59000
Name: Mileage, dtype: int64

 Print out Sell Price($) column as Pandas DataFrame

In [94]:
# Print out Sell Price($) column as Pandas DataFrame
x=cars[['Sell Price($)']]
print(type(x))
cars[['Sell Price($)']]

<class 'pandas.core.frame.DataFrame'>

                       Sell Price($)
Car Model
BMW X5                         18000
BMW X5                         34000
BMW X5                         26100
BMW X5                         40000
BMW X5                         31500
Audi A5                        29400
Audi A5                        32000
Audi A5                        19300
Audi A5                        12000
Mercedez Benz C class          22000
Mercedez Benz C class          20000
Mercedez Benz C class          21000
Mercedez Benz C class          33000

Print out DataFrame with Mileage and Sell Price($) columns

In [95]:
# Print out DataFrame with Mileage and Sell Price($) columns
cars[['Mileage', 'Age(yrs)']]

                       Mileage  Age(yrs)
Car Model
BMW X5                   69000         6
BMW X5                   35000         3
BMW X5                   57000         5
BMW X5                   22500         2
BMW X5                   46000         4
Audi A5                  59000         5
Audi A5                  52000         5
Audi A5                  72000         6
Audi A5                  91000         8
Mercedez Benz C class    67000         6
Mercedez Benz C class    83000         7
Mercedez Benz C class    79000         7
Mercedez Benz C class    59000         5

Square brackets can also be used to access observations (rows) from a DataFrame

Print out first 4 observations

In [96]:
# Print out first 4 observations
cars[0:4]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       69000          18000         6
BMW X5       35000          34000         3
BMW X5       57000          26100         5
BMW X5       22500          40000         2

Print out fifth and sixth observation

In [97]:
# Print out fifth and sixth observation
cars[4:6]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       46000          31500         4
Audi A5      59000          29400         5

You can also use loc and iloc to perform just about any data selection operation. iloc is integer index based, so you have to specify rows and columns by their integer index like you did in the previous exercise. loc is label-based, which means that you have to specify rows and columns based on their row and column labels.

Print out observation for the car in the fifth and sixth rows

In [102]:
# Print out observation for the car in the third row 
cars.iloc[4:6]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       46000          31500         4
Audi A5      59000          29400         5

Print out observations for BMW X5 and Audi A5

In [100]:
# Print out observations for BMW X5 and Audi A5
cars.loc[['BMW X5', 'Audi A5']]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       69000          18000         6
BMW X5       35000          34000         3
BMW X5       57000          26100         5
BMW X5       22500          40000         2
BMW X5       46000          31500         4
Audi A5      59000          29400         5
Audi A5      52000          32000         5
Audi A5      72000          19300         6
Audi A5      91000          12000         8

# Manipulating a DataFrames

## Combining Two DataFrames

Combinging multipe DataFrames can happen in different format. This includes concatination, join, and merge.

### Combine Two DataFrames Vertically 
Assume you have two DataFrames; brics_1 and brics_2. Each of these DataFrames includes a list of some countries and the capital and area of each country.

In [103]:
## brics_1 DataFrame

## creating lists
country = ["Brazil", "Russia", "India"] 
capital = ["Brasilia", "Moscow", "New Dehli"]
area = [8.516, 17.10, 3.286]
population = [200.4, 143.5, 1252]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series, 'population': population_series} 
  
brics_1 = pd.DataFrame(brics_dict) 
brics_1

  country    capital    area  population
0  Brazil   Brasilia   8.516       200.4
1  Russia     Moscow  17.100       143.5
2   India  New Dehli   3.286      1252.0

In [104]:
## brics_1 DataFrame

## creating lists
country = ["China", "South Africa"] 
capital = ["Beijing", "Pretoria"]
area = [9.597, 1.221]
population = [1357, 52.98]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series, 'population': population_series} 
  
brics_2 = pd.DataFrame(brics_dict) 
brics_2

        country   capital   area  population
0         China   Beijing  9.597     1357.00
1  South Africa  Pretoria  1.221       52.98

To combine these DataFrames vertically (axis=0), we will use also the Panda concat command.

In [105]:
brics = pd.concat([brics_1,brics_2],axis=0)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
0         China    Beijing   9.597     1357.00
1  South Africa   Pretoria   1.221       52.98

To ignore the indexing of the concatenated DataFrames and use new indexing, add **ignore_index=True** to the Panda concat command.

In [106]:
brics = pd.concat([brics_1,brics_2],ignore_index=True, axis=0)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

### Combine Two Frames Horizontally 
Assume you have a DataFrame that includes the country and its capital and its area called "brics_capital_area".

In [107]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
capital = ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.597, 1.221]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series} 
  
brics_capital_area = pd.DataFrame(brics_dict) 
  
brics_capital_area

        country    capital    area
0        Brazil   Brasilia   8.516
1        Russia     Moscow  17.100
2         India  New Dehli   3.286
3         China    Beijing   9.597
4  South Africa   Pretoria   1.221

Assume you have also a DataFrame that includes the country and its population (called "brics_population") in the same order of the previous DataFrame "brics_dict".

In [108]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
population = [200.4, 143.5, 1252, 1357, 52.98]

## converting lists to pandas series
country_series = pd.Series(country) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'population': population_series} 
  
brics_population = pd.DataFrame(brics_dict) 
  
brics_population

        country  population
0        Brazil      200.40
1        Russia      143.50
2         India     1252.00
3         China     1357.00
4  South Africa       52.98

To combine both DataFrames horizontally (axis=1), use the Panda concat command.

In [109]:
brics = pd.concat([brics_capital_area,brics_population], axis=1)
brics

        country    capital    area       country  population
0        Brazil   Brasilia   8.516        Brazil      200.40
1        Russia     Moscow  17.100        Russia      143.50
2         India  New Dehli   3.286         India     1252.00
3         China    Beijing   9.597         China     1357.00
4  South Africa   Pretoria   1.221  South Africa       52.98

To include only specific fields in the concatenation, you must index (name) these fields.

In [110]:
brics = pd.concat([brics_capital_area,brics_population['population']], axis=1)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

##Merging Two DataFrames

Assume you have a DataFrame that includes the country and its capital (called "brics_capital_area"). You also have a DataFrame that consists of the country and its population (called "brics_population"). You want to combine both DataFrames horizontally. However, You are not sure about the order of both DataFrames.

In [111]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
capital = ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.597, 1.221]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series} 
  
brics_capital_area = pd.DataFrame(brics_dict) 
  
brics_capital_area

        country    capital    area
0        Brazil   Brasilia   8.516
1        Russia     Moscow  17.100
2         India  New Dehli   3.286
3         China    Beijing   9.597
4  South Africa   Pretoria   1.221

In [112]:
## creating lists
country = ["Russia", "India", "China", "South Africa","Brazil"] 
population = [143.5, 1252, 1357, 52.98,200.4]

## converting lists to pandas series
country_series = pd.Series(country) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'population': population_series} 
  
brics_population = pd.DataFrame(brics_dict) 
  
brics_population

        country  population
0        Russia      143.50
1         India     1252.00
2         China     1357.00
3  South Africa       52.98
4        Brazil      200.40

In [115]:
pd.merge(brics_capital_area, brics_population, on=['country'])

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

# General Exercises
**Exercise 1.14:** Write a python code that creates two string variables and two floating-point number variables. The first string should contain your first name. The second string should contain your family name. The two floating numbers should contain two random numbers. After creating the variables, print out the full name in one line and the sum of the two floating-point numbers in another line.

In [ ]:
## Write your code here

**Exercise 1.15:** Write a python code that creates six integer variables that represent two dates; D1/M1/Y1 and D2/M2/Y2. Write a code that determines which of the two dates is the newest date. Print on screen the newest date.

In [ ]:
## Write your code here

**Exercise 1.16:** Write a python code that creates six integer variables that represent the current date D1/M1/Y1 and Date of Birth of a specific person D2/M2/Y2. Write a python code that computes the age of that person. Print the resulted age on screen.

In [ ]:
## Write your code here

**Exercise 1.17:** Write a python code that reads text from a file and write it to another file.

In [ ]:
## Write your code here

# References

The material of this notebook excluding the exercises are selected from \\
[1] pandas tutorial at learnpython.org \\
[2] Geeks for Geeks at https://www.geeksforgeeks.org/python-pandas-series/ \\
[3] Panda documents at https://pandas.pydata.org/pandas-docs/